#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.rhelai_cloud_key: Refreshing state... [id=19679c1803dd29daef62f6ee9c96ba447d72bc4f]
aws_key_pair.rhelai_cloud_key: Refreshing state... [id=rhelai_cloud_key]
aws_security_group_rule.rhelai_ingress_access: Refreshing state... [id=sgrule-3084980867]
aws_security_group_rule.https_ingress_access: Refreshing state... [id=sgrule-3280288496]
aws_iam_role.ec2_s3_access: Refreshing state... [id=ec2_s3_access_role]
aws_vpc.rhelai_vpc: Refreshing state... [id=vpc-06a3d74d4f3bda94c]
aws_iam_role_policy.s3_access_policy: Refreshing state... [id=ec2_s3_access_role:s3_access_policy]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2_s3_profile]
aws_internet_gateway.rhelai_igw: Refreshing state... [id=igw-0b7b3151bfaa3f5f9]
aws_security_group.rhelai_security_group: Refreshing state... [id=sg-04260b3e6fa9305ec]
aws_subnet.rhelai_subnet: Refreshing state... [id=subnet-0862c97c6dbac65b2]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-2879473671]
aws_security_group_rule.ssh_ingress_access: Refreshing state... [id=sgrule-1815271514]
aws_route_table.rhelai_pub_igw: Refreshing state... [id=rtb-01f1d3835d099e548]
aws_instance.rhelai_instance: Refreshing state... [id=i-0e505d09c37194c1d]
aws_route_table_association.rhelai_rt_subnet_public: Refreshing state... [id=rtbassoc-0392498c1737227a5]
null_resource.hostname_update: Refreshing state... [id=5391635331085250036]
ansible_host.rhelai_instance: Refreshing state... [id=ec2-18-226-248-198.us-east-2.compute.amazonaws.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group_rule.https_ingress_access will be destroyed
  # (because aws_security_group_rule.https_ingress_access is not in configuration)
  - resource "aws_security_group_rule" "https_ingress_access" {
      - cidr_blocks            = [
          - "98.97.81.235/32",
        ] -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-3280288496" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04260b3e6fa9305ec" -> null
      - security_group_rule_id = "sgr-0ce82a29f3d80876e" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
    }

  # aws_security_group_rule.rhelai_ingress_access will be destroyed
  # (because aws_security_group_rule.rhelai_ingress_access is not in configuration)
  - resource "aws_security_group_rule" "rhelai_ingress_access" {
      - cidr_blocks            = [
          - "98.97.81.235/32",
        ] -> null
      - from_port              = 3000 -> null
      - id                     = "sgrule-3084980867" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04260b3e6fa9305ec" -> null
      - security_group_rule_id = "sgr-017fa94e30e8f7ab2" -> null
      - self                   = false -> null
      - to_port                = 3000 -> null
      - type                   = "ingress" -> null
    }

  # aws_security_group_rule.ssh_ingress_access must be replaced
-/+ resource "aws_security_group_rule" "ssh_ingress_access" {
      ~ cidr_blocks              = [ # forces replacement
          - "98.97.81.235/32",
          + "0.0.0.0/0",
        ]
      ~ id                       = "sgrule-1815271514" -> (known after apply)
      ~ security_group_rule_id   = "sgr-04ff59404c132947b" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # null_resource.hostname_update is tainted, so must be replaced
-/+ resource "null_resource" "hostname_update" {
      ~ id = "5391635331085250036" -> (known after apply)
    }

Plan: 2 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*